# IsInUse Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
VoltageType..::..IsInUse Property
VoltageType Class See Also
---
Indicates whether this voltage type is in service now, such as by other distribution system.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool IsInUse { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsInUse As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsInUse {
	bool get ();
}
```

# See Also
VoltageType Class
Autodesk.Revit.DB.Electrical Namespace